---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NameInUse
source: html/cca337bb-dd6b-39db-06a7-3084b2470c4c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.NameInUse Property

The name "[Name]" is already in use.

## Syntax (C#)
```csharp
public static FailureDefinitionId NameInUse { get; }
```